---
title: Заводим шину I2C на STM32F0 на Chibios
layout: post
---
Само по себе шину завести не представляет труда. Однако я промучался два дня, подбирая всевозможные
варианты "почему-оно-неработает". Итак, для начала:

1) в halconf.h и mcuconf.h надо включить соответствующий драйвер I2C.
2) в программе нужно сделать i2cStart(&I2CDx, &i2cfg), где x - номер порта I2C, а i2cfg распишем.

```
static const I2CConfig i2cfg = {
	0x0090194B,	// Это на 48МГц мы заводим шину на 400КГц, с фронтами по 100нс.
	0,
	0			// Тут может быть I2C_CR2_ADD10 (включить 10-битный адрес)
};
```

3) И самое главное, беэ этого работать не будет вообще:

```
/* 
 * Включить на 6 и 7 порта B альтернативную ф-цию I2C и
 * перевести в режим с открытым стоком.
 */
palSetPadMode(GPIOB, 6, PAL_MODE_ALTERNATE(1) | PAL_STM32_OTYPE_OPENDRAIN); // SCL
palSetPadMode(GPIOB, 7, PAL_MODE_ALTERNATE(1) | PAL_STM32_OTYPE_OPENDRAIN); // SDA
```

Для отладки полезно смотреть шину логически анализатором. Мне не повезло, такого прибора
у меня пока нет. Но и повезло, что оказалась под рукой плата STM32F4, на которую я нашел
прошивку логического анализатора :) Вот <a href="https://code.google.com/p/logicdiscovery/">ссылка</a>. 
И графический клиент к нему <a href="http://www.lxtreme.nl/ols/#Download/">тут</a>. Клиент под Linux
у меня завелся с полпинка, все показал и очень помог.
